Revit 2027 API
FabricationItemFile.Identifier Property
 The string identifier for the item file. This string is unique and can be used to compare whether fabrication item files are the same file.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public string Identifier { get; }
Public ReadOnly Property Identifier As String
	Get
public:
property String^ Identifier {
	String^ get ();
}
member Identifier : string with get
Property Value
String
See Also
Reference
FabricationItemFile Class
Autodesk.Revit.DB Namespace